todolist/app/controllers/lists_controller.rb

SELECT  "lists".* FROM "lists" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "lists"
---
  def index
    #@lists = List.all
		@lists = List.paginate(:page => params[:page], :per_page => 5)

INSERT INTO "lists" ("title", "content", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @list = List.new(list_params)

    respond_to do |format|
      if @list.save

UPDATE "lists" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["title", "Odebrać dzieci z przedszkola2"], ["content", "Nie zapomnieć ani jednego.2"], ["updated_at", 2016-03-12 12:06:11 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @list.update(list_params)

DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]
---
  def destroy
    @list.destroy

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_list
      @list = List.find(params[:id])